#include <iostream>
using namespace std;

int main() {

    setlocale(LC_ALL, "RU");
    int day;

    cout << "Введіть номер дня тижня (1 - Понеділок, 7 - Неділя): ";
    cin >> day;

    switch (day) {
    case 1:
        cout << "Понеділок: \n1. Вища математика\n2. Архітектура інформаційних систем\n3.Основи аналітики даних\n";
        break;
    case 2:
        cout << "Вівторок: \n1. Іноземна мова\n2. Програмування C++\n3. Програмування C++\n";
        break;
    case 3:
        cout << "Середа: \n1. Вища математика\n2. Вища математика\n3. Іноземна мова\n";
        break;
    case 4:
        cout << "Четвер: \n1. Іноземна мова\n2. Вища математика\n";
        break;
    case 5:
        cout << "П'ятниця: \n1. Філософія\n2. Філософія\n3.";
        break;
    case 6:
        cout << "Субота: \n1. Конвергентна мережна інфраструктура";
        break;
    case 7:
        cout << "Неділя: Вихідний день, пар немає.\n";
        break;
    default:
        cout << "Невірний номер дня! Введіть число від 1 до 7.\n";
        break;
    }

    return 0;
}
